test_cases/RANS_kOmega-SST_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;                                        // all following lenghts are in mm

// general variables 
pi 3.1415926535;
angleDeg 20;                                          // angle of the ramp
angle #eval{$angleDeg/180*$pi}; 
lenghtRamp 337;                                       // lenght of the ramp
hight 400;                                            // hight to the upper wall
inletX 200;                                           // lenght of the inlet with noSlip BC
PreInletX 100;                                        // lenght of the inlet with slip BC // later refered to as PreInlet
outletX #eval{cos($angle)*$lenghtRamp+5*$lenghtRamp}; // lenght of outlet behind the ramp. 5x is a approximation which has to be testet
jetLowEdge 270;                                       // distance between the low edge of the jet and the end of the ramp
jetHight 0.5;                                         // hight of the Jet opening
width2D 1;
hightMidPlane 125;                                    // hight of the plane in the middle of the mesh to help refining the lower part
angleRedSkewness #eval{$angleDeg/2};                  // angle of the left side of main block to reduce the skewness of the cell abovr the ramp
angleRedSkew1 #eval{$angleRedSkewness/180*$pi};  
angleRedSkewness2 #eval{$angleDeg/2};;                // angle of the right side of the main block to reduce the skewness of the cell abovr the ramp
angleRedSkew2 #eval{$angleRedSkewness2/180*$pi};  

// number of cells for each block  
nCellXPreInlet 13;
nCellXInlet 50;
nCellXMainLeft 45;
nCellXJet 1;
nCellXMainRight 160;
nCellXOutlet 400;

nCellYlow 50;
nCellYhigh 50;

nCellZJet 2;

// Grading parameters
GradXPreInlet 1.0;     // >1 to refine downstream
GradXInlet 2.8;        // >1 to refine downstream
GradXMainLeft 3.0;      
GradXJet 1.0;           
GradXMainRight 0.333;     
GradXOutlet 0.4;       

GradYLow 3.0;         // >1 to refine in direction of the wall  
GradYHigh (2.0 0.5);

vertices
(
    (#eval{-$PreInletX-$inletX} 0 $width2D) //73 0
    (#eval{-$PreInletX-$inletX} 0 -$width2D) //74 1    
    (#eval{-$PreInletX-$inletX} $hightMidPlane $width2D) //77 2
    (#eval{-$PreInletX-$inletX} $hightMidPlane -$width2D) //78 3    
    (#eval{-$PreInletX-$inletX} $hight $width2D) //81 4
    (#eval{-$PreInletX-$inletX} $hight -$width2D) //82 5

    (-$inletX 0 $width2D)  //48 6
    (-$inletX 0 -$width2D)  //49 7
    (-$inletX $hightMidPlane $width2D)  //50 8
    (-$inletX $hightMidPlane -$width2D)  //51 9
    (-$inletX $hight $width2D)  //52   10
    (-$inletX $hight -$width2D)  //53 11
    
    (0 0 $width2D)  //54 12
    (0 0 -$width2D)  //55 13
    (#eval{tan($angleRedSkew1)*$hightMidPlane} $hightMidPlane $width2D)  //56 14
    (#eval{tan($angleRedSkew1)*$hightMidPlane} $hightMidPlane -$width2D)  //57 15
    (#eval{tan($angleRedSkew1)*$hight} $hight $width2D)  //58 16
    (#eval{tan($angleRedSkew1)*$hight} $hight -$width2D)  //59 17

    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge-$jetHight)} #eval{-sin($angle)*($lenghtRamp-$jetLowEdge-$jetHight)} $width2D) //19 18
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge-$jetHight)} #eval{-sin($angle)*($lenghtRamp-$jetLowEdge-$jetHight)} -$width2D) //18 19
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge-$jetHight)+tan($angleRedSkew1)*($hightMidPlane)} #eval{$hightMidPlane-sin($angle)*($lenghtRamp-$jetLowEdge-$jetHight)} $width2D) //31 20
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge-$jetHight)+tan($angleRedSkew1)*($hightMidPlane)} #eval{$hightMidPlane-sin($angle)*($lenghtRamp-$jetLowEdge-$jetHight)} -$width2D) //30 21
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge-$jetHight)+tan($angleRedSkew1)*($hight+(sin($angle)*($lenghtRamp-$jetLowEdge-$jetHight)))} $hight $width2D) //35 22
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge-$jetHight)+tan($angleRedSkew1)*($hight+(sin($angle)*($lenghtRamp-$jetLowEdge-$jetHight)))} $hight -$width2D) //34 23

    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge)} #eval{-sin($angle)*($lenghtRamp-$jetLowEdge)} $width2D) //16 24
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge)} #eval{-sin($angle)*($lenghtRamp-$jetLowEdge)} -$width2D) //17 25
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge)+tan($angleRedSkew1)*($hightMidPlane)} #eval{$hightMidPlane-sin($angle)*($lenghtRamp-$jetLowEdge)} $width2D) //28 26
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge)+tan($angleRedSkew1)*($hightMidPlane)} #eval{$hightMidPlane-sin($angle)*($lenghtRamp-$jetLowEdge)} -$width2D) //29 27
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge)+tan($angleRedSkew1)*($hight+(sin($angle)*($lenghtRamp-$jetLowEdge)))} $hight $width2D) //32 28
    (#eval{cos($angle)*($lenghtRamp-$jetLowEdge)+tan($angleRedSkew1)*($hight+(sin($angle)*($lenghtRamp-$jetLowEdge)))} $hight -$width2D) //33 29

    (#eval{cos($angle)*$lenghtRamp} #eval{ (-1)*(sin($angle))*$lenghtRamp} $width2D)  //60 30
    (#eval{cos($angle)*$lenghtRamp} #eval{ (-1)*(sin($angle))*$lenghtRamp} -$width2D)  //61 31
    (#eval{(cos($angle)*($lenghtRamp))+(tan($angleRedSkew2)*$hightMidPlane)} #eval{$hightMidPlane-sin($angle)*($lenghtRamp)} $width2D)  //62 32
    (#eval{(cos($angle)*($lenghtRamp))+(tan($angleRedSkew2)*$hightMidPlane)} #eval{$hightMidPlane-sin($angle)*($lenghtRamp)} -$width2D)  //63 33    
    (#eval{cos($angle)*($lenghtRamp)+tan($angleRedSkew1)*($hight+(sin($angle)*($lenghtRamp)))} $hight $width2D)  //64 34
    (#eval{cos($angle)*($lenghtRamp)+tan($angleRedSkew1)*($hight+(sin($angle)*($lenghtRamp)))} $hight -$width2D)  //65 35
    
    ($outletX #eval{ (-1)*sin($angle)*$lenghtRamp} $width2D) //66 36
    ($outletX #eval{ (-1)*sin($angle)*$lenghtRamp} -$width2D) //67 37
    ($outletX #eval{$hightMidPlane-sin($angle)*($lenghtRamp)} $width2D) //68 38
    ($outletX #eval{$hightMidPlane-sin($angle)*($lenghtRamp)} -$width2D) //69 39
    ($outletX $hight $width2D) //70 40
    ($outletX $hight -$width2D) //71 41      
    );


blocks
(
    // pre inlet block // (z x y)
    hex (6 7 1 0 8 9 3 2)  // bottom
    ($nCellZJet $nCellXPreInlet $nCellYlow)
    simpleGrading (1 $GradXPreInlet $GradYLow)

    hex (8 9 3 2 10 11 5 4)  // top
    ($nCellZJet $nCellXPreInlet $nCellYhigh)
    simpleGrading (1 $GradXPreInlet $GradYHigh)

    // inlet Block 
    hex (12 13 7 6 14 15 9 8) // bottom
    ($nCellZJet $nCellXInlet $nCellYlow)                 
    simpleGrading (1 $GradXInlet $GradYLow)

    hex (14 15 9 8 16 17 11 10) // top
    ($nCellZJet $nCellXInlet $nCellYhigh)                 
    simpleGrading (1 $GradXInlet $GradYHigh)


    // Main 
    hex (18 19 13 12 20 21 15 14) // left bottom 
    ($nCellZJet $nCellXMainLeft $nCellYlow)                 
    simpleGrading (1 $GradXMainLeft $GradYLow)

    hex (20 21 15 14 22 23 17 16)  // left top 
    ($nCellZJet $nCellXMainLeft $nCellYhigh)                 
    simpleGrading (1 $GradXMainLeft $GradYHigh)

    hex (24 25 19 18 26 27 21 20) // jet bottom 
    ($nCellZJet $nCellXJet $nCellYlow)                 
    simpleGrading (1 $GradXJet $GradYLow)

    hex (26 27 21 20 28 29 23 22) // jet top
    ($nCellZJet $nCellXJet $nCellYhigh)                 
    simpleGrading (1 $GradXJet $GradYHigh)

    hex (30 31 25 24 32 33 27 26) // right bottom 
    ($nCellZJet $nCellXMainRight $nCellYlow)                 
    simpleGrading (1 $GradXMainRight $GradYLow)

    hex (32 33 27 26 34 35 29 28)  // right top 
    ($nCellZJet $nCellXMainRight $nCellYhigh)                 
    simpleGrading (1 $GradXMainRight $GradYHigh)

    // Outlet Block 
    hex (36 37 31 30 38 39 33 32)  // bottom 
    ($nCellZJet $nCellXOutlet $nCellYlow)                 
    simpleGrading (1 $GradXOutlet $GradYLow)

    hex (38 39 33 32 40 41 35 34)  // top
    ($nCellZJet $nCellXOutlet $nCellYhigh)                 
    simpleGrading (1 $GradXOutlet $GradYHigh)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
           (0 1 3 2)
           (2 3 5 4)
        );
    }
  
    outlet
    {
        type patch;
        faces
        (
            (36 37 39 38)
            (38 39 41 40)                       
        );
    }
    wallPreInlet
    {
        type wall;
        faces
        (
        // upper wall
        (10 11 5 4)
        // lower wall
        (6 7 1 0)
        );

    }
    upperWall
    {
        type wall;
        faces
        (
            (16 17 11 10)
            (22 23 17 16)
            (28 29 23 22)
            (34 35 29 28)
            (40 41 35 34)       
        );
    }
    lowerWall  
    {
        type wall;
        faces
        (
            (12 13 7 6)
            (18 19 13 12)
            
            (30 31 25 24)
            (36 37 31 30)                             
        );
    }
    Jet
    {
        type wall;   // just to try without the jet active
        faces 
        (
            (25 19 18 24)
        );
    }
    frontAndBack
    {
        type            empty;
        faces
        (
            // front
            (6 8 2 0)
            (8 10 4 2)

            (12 14 8 6)
            (14 16 10 8)

            (18 20 14 12)
            (20 22 16 14)

            (24 26 20 18)
            (26 28 22 20)

            (30 32 26 24)
            (32 34 28 26)

            (36 38 32 30)
            (38 40 34 32)
            // back 
            (7 9 3 1)
            (9 11 5 3)

            (13 15 9 7)
            (15 17 11 9)

            (19 21 15 13)
            (21 23 17 15)

            (25 27 21 19)
            (27 29 23 21)

            (31 33 27 25)
            (33 35 29 27)

            (37 39 33 31)
            (39 41 35 33)            
        );
    }
);


// ************************************************************************* //
